[
  {
    "language": "de",
    "order": 1,
    "title": "A1.1: Deutsch für Anfänger",
    "description": "Einführung in das deutsche Alphabet, Aussprache, Begrüßungen, Zahlen und sehr einfache Satzstrukturen."
  },
  {
    "language": "de",
    "order": 2,
    "title": "A1.2: Erste Gespräche",
    "description": "Einfache Dialoge über Familie, Herkunft, Essen und Alltag. Aufbau eines grundlegenden Wortschatzes."
  },
  {
    "language": "de",
    "order": 3,
    "title": "A1.3: Sicher im Alltag",
    "description": "Kurze Gespräche im Alltag führen, einfache Fragen stellen und beantworten sowie grundlegende Grammatik festigen."
  },

  {
    "language": "de",
    "order": 4,
    "title": "A2.1: Erweiterter Alltag",
    "description": "Gespräche über Einkaufen, Reisen und Freizeit. Einführung in Vergangenheitsformen und häufige Redewendungen."
  },
  {
    "language": "de",
    "order": 5,
    "title": "A2.2: Praktische Kommunikation",
    "description": "Alltägliche Situationen sicher meistern, kurze Texte verstehen und komplexere Sätze bilden."
  },
  {
    "language": "de",
    "order": 6,
    "title": "A2.3: Mehr Ausdruck und Verständnis",
    "description": "Meinungen einfach ausdrücken, Erlebnisse beschreiben und Gespräche zusammenhängend führen."
  },

  {
    "language": "de",
    "order": 7,
    "title": "B1.1: Selbstständig kommunizieren",
    "description": "Über Erfahrungen, Wünsche und Ziele sprechen und die Hauptpunkte längerer Gespräche verstehen."
  },
  {
    "language": "de",
    "order": 8,
    "title": "B1.2: Deutsch im Alltag und Beruf",
    "description": "Flüssigere Kommunikation bei Arbeit, Studium und Reisen sowie sicherer Umgang mit Zeitformen."
  },
  {
    "language": "de",
    "order": 9,
    "title": "B1.3: Strukturierte Sprache",
    "description": "Gedanken klar strukturieren, Argumente formulieren und zusammenhängende Texte erstellen."
  },

  {
    "language": "de",
    "order": 10,
    "title": "B2.1: Fortgeschrittene Gespräche",
    "description": "Teilnahme an Diskussionen, Verständnis komplexerer Texte und spontanes Sprechen."
  },
  {
    "language": "de",
    "order": 11,
    "title": "B2.2: Sprachliche Sicherheit",
    "description": "Nuancierter Sprachgebrauch, idiomatische Ausdrücke und sicheres Verstehen abstrakter Themen."
  },
  {
    "language": "de",
    "order": 12,
    "title": "B2.3: Fließend und präzise",
    "description": "Nahezu fehlerfreie Kommunikation, präzise Ausdrucksweise und hohe sprachliche Flexibilität."
  },

  {
    "language": "de",
    "order": 13,
    "title": "C1.1: Akademisches und professionelles Deutsch",
    "description": "Verstehen anspruchsvoller Texte, strukturierte Argumentation und präziser mündlicher Ausdruck."
  },
  {
    "language": "de",
    "order": 14,
    "title": "C1.2: Stil und Feinheiten",
    "description": "Sprachliche Nuancen, Registerwahl und komplexe schriftliche sowie mündliche Kommunikation."
  },
  {
    "language": "de",
    "order": 15,
    "title": "C1.3: Souveräne Sprachbeherrschung",
    "description": "Fließende, flexible und wirkungsvolle Kommunikation in akademischen und beruflichen Kontexten."
  },

  {
    "language": "de",
    "order": 16,
    "title": "C2.1: Höchste Sprachkompetenz",
    "description": "Müheloses Verstehen nahezu aller Inhalte sowie spontane und präzise Ausdrucksweise."
  },
  {
    "language": "de",
    "order": 17,
    "title": "C2.2: Nahezu muttersprachliche Kompetenz",
    "description": "Feinste Bedeutungsunterschiede verstehen, stilistisch sicher kommunizieren und komplexe Inhalte meistern."
  },
  {
    "language": "de",
    "order": 18,
    "title": "C2.3: Sprachliche Meisterschaft",
    "description": "Vollständige Kontrolle über Sprache, Stil und Ton in jeder Situation auf muttersprachlichem Niveau."
  },
  {
    "language": "en",
    "order": 1,
    "title": "A1.1: Getting Started",
    "description": "Introduction to the English alphabet, pronunciation, basic greetings, numbers, and very simple sentence structures."
  },
  {
    "language": "en",
    "order": 2,
    "title": "A1.2: First Conversations",
    "description": "Simple dialogues about personal information, family, food, and daily activities with basic vocabulary."
  },
  {
    "language": "en",
    "order": 3,
    "title": "A1.3: Everyday Basics",
    "description": "Communicate in simple everyday situations, ask and answer basic questions, and reinforce core grammar."
  },

  {
    "language": "en",
    "order": 4,
    "title": "A2.1: Expanding Daily Communication",
    "description": "Talk about shopping, travel, hobbies, and routines while learning past and future forms."
  },
  {
    "language": "en",
    "order": 5,
    "title": "A2.2: Practical Communication",
    "description": "Handle common real-life situations, understand short texts, and form more complex sentences."
  },
  {
    "language": "en",
    "order": 6,
    "title": "A2.3: Expressing Experiences",
    "description": "Describe experiences, express simple opinions, and maintain short conversations more confidently."
  },

  {
    "language": "en",
    "order": 7,
    "title": "B1.1: Independent Communication",
    "description": "Discuss experiences, plans, and goals and understand the main points of longer conversations."
  },
  {
    "language": "en",
    "order": 8,
    "title": "B1.2: Work, Study, and Travel",
    "description": "Communicate more fluently in professional, academic, and travel situations using varied grammar."
  },
  {
    "language": "en",
    "order": 9,
    "title": "B1.3: Structured Expression",
    "description": "Organize ideas clearly, give reasons and explanations, and produce coherent spoken and written texts."
  },

  {
    "language": "en",
    "order": 10,
    "title": "B2.1: Advanced Conversations",
    "description": "Participate actively in discussions, understand complex texts, and speak more spontaneously."
  },
  {
    "language": "en",
    "order": 11,
    "title": "B2.2: Confident Fluency",
    "description": "Use idiomatic expressions, refine accuracy, and understand abstract and technical topics."
  },
  {
    "language": "en",
    "order": 12,
    "title": "B2.3: Fluent and Precise",
    "description": "Communicate clearly and naturally with minimal hesitation across a wide range of contexts."
  },

  {
    "language": "en",
    "order": 13,
    "title": "C1.1: Academic and Professional Communication",
    "description": "Understand demanding texts, present complex ideas clearly, and use language flexibly and effectively."
  },
  {
    "language": "en",
    "order": 14,
    "title": "C1.2: Style and Nuance",
    "description": "Master tone, register, and subtle meaning differences in advanced spoken and written communication."
  },
  {
    "language": "en",
    "order": 15,
    "title": "C1.3: Advanced Mastery",
    "description": "Express ideas fluently, precisely, and persuasively in academic and professional environments."
  },

  {
    "language": "en",
    "order": 16,
    "title": "C2.1: Highest Proficiency",
    "description": "Understand virtually everything heard or read and express yourself spontaneously and accurately."
  },
  {
    "language": "en",
    "order": 17,
    "title": "C2.2: Near-Native Competence",
    "description": "Convey fine shades of meaning, adapt style naturally, and communicate with native-like precision."
  },
  {
    "language": "en",
    "order": 18,
    "title": "C2.3: Language Mastery",
    "description": "Demonstrate complete control of language in any situation with native-level fluency and sophistication."
  },
  {
    "language": "fr",
    "order": 1,
    "title": "A1.1: Premiers pas",
    "description": "Introduction à l’alphabet français, à la prononciation, aux salutations, aux nombres et aux phrases très simples."
  },
  {
    "language": "fr",
    "order": 2,
    "title": "A1.2: Premières conversations",
    "description": "Dialogues simples sur les informations personnelles, la famille, la nourriture et les activités quotidiennes."
  },
  {
    "language": "fr",
    "order": 3,
    "title": "A1.3: Bases du quotidien",
    "description": "Communiquer dans des situations courantes, poser et répondre à des questions simples et consolider la grammaire de base."
  },

  {
    "language": "fr",
    "order": 4,
    "title": "A2.1: Communication du quotidien",
    "description": "Parler des achats, des voyages, des loisirs et des habitudes en utilisant le passé et le futur."
  },
  {
    "language": "fr",
    "order": 5,
    "title": "A2.2: Communication pratique",
    "description": "Gérer des situations réelles, comprendre des textes courts et construire des phrases plus complexes."
  },
  {
    "language": "fr",
    "order": 6,
    "title": "A2.3: Exprimer ses expériences",
    "description": "Décrire des expériences, exprimer des opinions simples et maintenir des conversations courtes avec plus d’assurance."
  },

  {
    "language": "fr",
    "order": 7,
    "title": "B1.1: Communication autonome",
    "description": "Parler de ses expériences, projets et objectifs et comprendre les points essentiels de conversations plus longues."
  },
  {
    "language": "fr",
    "order": 8,
    "title": "B1.2: Travail, études et voyages",
    "description": "Communiquer avec plus de fluidité dans des contextes professionnels, académiques et de voyage."
  },
  {
    "language": "fr",
    "order": 9,
    "title": "B1.3: Expression structurée",
    "description": "Organiser clairement ses idées, justifier ses opinions et produire des textes oraux et écrits cohérents."
  },

  {
    "language": "fr",
    "order": 10,
    "title": "B2.1: Conversations avancées",
    "description": "Participer activement à des discussions, comprendre des textes complexes et s’exprimer spontanément."
  },
  {
    "language": "fr",
    "order": 11,
    "title": "B2.2: Fluidité et assurance",
    "description": "Utiliser des expressions idiomatiques, améliorer la précision et comprendre des sujets abstraits."
  },
  {
    "language": "fr",
    "order": 12,
    "title": "B2.3: Expression fluide et précise",
    "description": "Communiquer naturellement avec peu d’hésitation dans une grande variété de situations."
  },

  {
    "language": "fr",
    "order": 13,
    "title": "C1.1: Communication académique et professionnelle",
    "description": "Comprendre des textes exigeants, présenter des idées complexes clairement et utiliser la langue avec souplesse."
  },
  {
    "language": "fr",
    "order": 14,
    "title": "C1.2: Style et nuances",
    "description": "Maîtriser le ton, le registre et les nuances de sens à l’oral comme à l’écrit."
  },
  {
    "language": "fr",
    "order": 15,
    "title": "C1.3: Maîtrise avancée",
    "description": "Exprimer ses idées avec fluidité, précision et efficacité dans des contextes complexes."
  },

  {
    "language": "fr",
    "order": 16,
    "title": "C2.1: Très haut niveau",
    "description": "Comprendre presque tout ce qui est entendu ou lu et s’exprimer spontanément avec exactitude."
  },
  {
    "language": "fr",
    "order": 17,
    "title": "C2.2: Compétence quasi native",
    "description": "Saisir les nuances les plus fines, adapter son style naturellement et communiquer avec une grande précision."
  },
  {
    "language": "fr",
    "order": 18,
    "title": "C2.3: Maîtrise totale de la langue",
    "description": "Contrôler parfaitement la langue, le style et le ton dans toutes les situations, à un niveau proche du natif."
  },
  {
    "language": "es",
    "order": 1,
    "title": "A1.1: Primeros pasos",
    "description": "Introducción al alfabeto español, la pronunciación, los saludos, los números y frases muy sencillas."
  },
  {
    "language": "es",
    "order": 2,
    "title": "A1.2: Primeras conversaciones",
    "description": "Diálogos simples sobre información personal, la familia, la comida y las actividades diarias."
  },
  {
    "language": "es",
    "order": 3,
    "title": "A1.3: Bases cotidianas",
    "description": "Comunicarte en situaciones comunes, hacer y responder preguntas básicas y reforzar la gramática esencial."
  },

  {
    "language": "es",
    "order": 4,
    "title": "A2.1: Comunicación diaria",
    "description": "Hablar de compras, viajes, aficiones y rutinas usando el pasado y el futuro."
  },
  {
    "language": "es",
    "order": 5,
    "title": "A2.2: Comunicación práctica",
    "description": "Manejar situaciones reales, comprender textos cortos y construir oraciones más complejas."
  },
  {
    "language": "es",
    "order": 6,
    "title": "A2.3: Expresar experiencias",
    "description": "Describir experiencias, expresar opiniones simples y mantener conversaciones cortas con mayor seguridad."
  },

  {
    "language": "es",
    "order": 7,
    "title": "B1.1: Comunicación autónoma",
    "description": "Hablar sobre experiencias, planes y objetivos y comprender los puntos principales de conversaciones más largas."
  },
  {
    "language": "es",
    "order": 8,
    "title": "B1.2: Trabajo, estudio y viajes",
    "description": "Comunicarte con mayor fluidez en contextos profesionales, académicos y de viaje."
  },
  {
    "language": "es",
    "order": 9,
    "title": "B1.3: Expresión estructurada",
    "description": "Organizar ideas con claridad, justificar opiniones y producir textos orales y escritos coherentes."
  },

  {
    "language": "es",
    "order": 10,
    "title": "B2.1: Conversaciones avanzadas",
    "description": "Participar activamente en debates, comprender textos complejos y expresarte de forma espontánea."
  },
  {
    "language": "es",
    "order": 11,
    "title": "B2.2: Fluidez y seguridad",
    "description": "Usar expresiones idiomáticas, mejorar la precisión y comprender temas abstractos."
  },
  {
    "language": "es",
    "order": 12,
    "title": "B2.3: Expresión fluida y precisa",
    "description": "Comunicarte de manera natural y clara con mínimas pausas en una amplia variedad de situaciones."
  },

  {
    "language": "es",
    "order": 13,
    "title": "C1.1: Comunicación académica y profesional",
    "description": "Comprender textos exigentes, presentar ideas complejas con claridad y usar el idioma con flexibilidad."
  },
  {
    "language": "es",
    "order": 14,
    "title": "C1.2: Estilo y matices",
    "description": "Dominar el tono, el registro y los matices de significado en la comunicación oral y escrita."
  },
  {
    "language": "es",
    "order": 15,
    "title": "C1.3: Dominio avanzado",
    "description": "Expresar ideas con fluidez, precisión y eficacia en contextos complejos."
  },

  {
    "language": "es",
    "order": 16,
    "title": "C2.1: Máxima competencia",
    "description": "Comprender prácticamente todo lo que se oye o se lee y expresarse de forma espontánea y precisa."
  },
  {
    "language": "es",
    "order": 17,
    "title": "C2.2: Competencia casi nativa",
    "description": "Captar los matices más sutiles, adaptar el estilo de forma natural y comunicarte con gran precisión."
  },
  {
    "language": "es",
    "order": 18,
    "title": "C2.3: Dominio total del idioma",
    "description": "Control absoluto del idioma, el estilo y el tono en cualquier situación, a un nivel cercano al nativo."
  }
]
